[
	{
		"name":"2016-05-14",
		"title":"Creating Your First Website With IIS",
		"date":"2016-05-14",
		"category":"posts",
		"keywords":"Website,IIS,hosts,binding",
		"description":"Create your first website. Some recommendations too.",
		"header":"This is the first part if you want to create your own backend or really anything that needs processing. Later on we will be looking at Cloudfront that will help us with the instance.",
		"html":"<p>Let me first say YES this is my first post!</p><p class='justify'>Secondly, this post is not your answer in how to create your first website. There are too many ways to do it. I can only make recommendations. The foremost is to have fun!</p><p class='justify'>My girlfriend, Rina, has been wanting to make a site but has no idea where to start. Luckily, I have a friend, Victor, who has been learning a lot in the past few months. So I connected them and it seems that it mutually benefits both of them. Having multiple code friends or mentors is better than one.</p><p class='justify'>Learn the basics. That is html. This can be accomplished by going to any tutorial site. I like w3schools.com/html/. If you find that to complicated try searching on your neighborhood friendly search site 'learn html'. Go through and learn, read, explore! Go to multiple sources, take a class, and ask questions to your tech guru.</p><p class='justify'>Learn CSS, JavaScript (not to be confused with Java, even though Java is a fun language to learn), get comfortable with a framework like Bootstrap. The choices are endless.</p><p class='justify'>Google is your friend. Your questions have been asked. Go search them on the internet.</p><br><p>I'll end lastly with some help setting up a site so you don't have to double click you html file to show it on your browser. You can just type localhost, or better yet, 'mywebsite' in the URL.</p><p class='justify'>First you will need IIS. Thankfully it is built into windows. If you are not on windows, I am sorry. IIS is a web server. If you want to know more what it is, google it. Let's activate it.</p><a href='/images/p1.jpg' target='_blank' class='center'><img src='/images/p1.jpg' class='img-thumbnail img-article' alt='Turn on windows features'></a><a href='/images/p2.jpg' target='_blank' class='center'><img src='/images/p2.jpg' class='img-thumbnail img-article' alt='Turn on IIS'></a><p>Go to programs and features and follow the arrows.</p><p class='justify'>IIS should start automatically and be in your start menu after pressing OK. Full disclosure, I am doing this my memory so I might miss a step.</p><a href='/images/p3.jpg' target='_blank' class='center'><img src='/images/p3.jpg' class='img-thumbnail img-article' alt='IIS main screen'></a><p class='justify'>You will see this screen. From here you will want to open the Sites folder on the left hand side. You should see Default Web Site with a world by it. Click that too.</p><p class='justify'>On the right hand side, you will see some more stuff. Click Basic Settings. Enter the Physical Path. Click test settings and hopefully you will get two green checks. If you don't, click connect as and enter your username (full email) and password for logging into your computer. If you use a different domain for an email, you must put the domain name with a '\\' and then your email. It will sort of look like this DOMAINNAME\\youremail@DOMAINNAME.com. I am not sure why this just works without entering your user credentials but please let me know if you know what I am doing wrong.</p><p class='justify'>At this point, click 'Browse *:80 (http)' and you should see your site as localhost.</p><p class='justify'>Say we want to change that to mywebsite. On the left side of IIS, right click the Sites folder and choose 'Add Website'.</p><a href='/images/p4.jpg' target='_blank' class='center'><img src='/images/p4.jpg' class='img-thumbnail img-article' alt='Add Website'></a><p class='justify'>Enter a site name, mywebsite. Set the Physical Path. Connect as you. Leave the Binding area alone except the Host name where you will put 'mywebsite'. Click OK.</p><p class='justify'>If you browse mywebsite, you will see that it does not work. To fix this, go browse to <em>C:\\Windows\\System32\\drivers\\etc</em>. Edit the hosts file.  Oops, you may not have permission. To remedy this, right click the hosts file, click the Security tab, click Edit, select Users and give yourself full control.</p><a href='/images/p5.jpg' target='_blank' class='center'><img src='/images/p5.jpg' class='img-thumbnail img-article' alt='Set Permissions'></a><p class='justify'>Now edit the hosts file. At the bottom of the file, add '127.0.0.1&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;mywebsite'. Save. </p><a href='/images/p6.jpg' target='_blank' class='center'><img src='/images/p6.jpg' class='img-thumbnail img-article' alt='Hosts File'></a><p>Now try browsing mywebsite.</p><p class='justify'>Let me know if I should add any more details, suggestions, stories, photos or just complement me. You're welcome.</p>"
	},
	{
		"name":"2016-05-15",
		"title":"Creating an AWS Account",
		"date":"2016-05-15",
		"category":"posts",
		"keywords":"AWS,Account",
		"description":"Create an AWS Account.",
		"header":"You created a website? Great! But now what? Are you ready to put it online? Where do you start? Well this may be a option for you to begin with if you continue on the next posts.",
		"html":"<p>Hello all. Welcome Back.</p><p class='justify'>I want to introduce you to Amazon's Amazon Web Service (AWS). It is basically all things cloud. My goal is to provide a quick way to set up your site plus a few things after setting it up.</p><p class='justify'>Some people have asked me why I chose AWS over Azure from Microsoft. Well simply I did not have a credit card and AWS would accept a debit card where Azure would not. If you plan on using Azure, then I am sorry to say that my posts may not help you. Maybe in the future I will. Probably not.</p><p class='justify'>So how to get started. You will have to sign up and register. You will need a card. Just sign up. You won’t need to pay for anything if you don’t use anything. Plus, there is a free tier to do things for free. Note that later on I will show you how to register a domain which will cost money and if you use AWS more than a year, you will have to pay for the free tier.</p><p>Now that you signed up, you will most likely see a dashboard like this.</p><a href='/images/p7.jpg' target='_blank' class='center'><img src='/images/p7.jpg' class='img-thumbnail img-article' alt='AWS Console'></a><p>That is it for this post. Good job. You like did it without any instructions. Just like creating a Facebook account. Let me know if you have questions.</p>"
	},
	{
		"name":"2016-05-15",
		"title":"Upload Site to S3",
		"date":"2016-05-15",
		"category":"posts",
		"keywords":"S3,AWS,Bucket,Route 53,Bucket Policy",
		"description":"See how to upload you website to S3 and get prepared to use your own domain using Route 53.",
		"header":"Upload your site here and actually see it up on the web. We will not make a custom domain name in this one. Next one will will. Just you wait, but look at this one first. Oh, look at the one before if you did not read it unless your smart at signing in into things.",
		"html":"<p class='justify'>There are many sites that you can put your site on the internet for free. Sadly, I did not have an easy way to do this when I started designing webpages. But free comes with strings attached. They will not let you have your own domain name. You will have to be under theirs. Some even have a water mark, yuck! AWS lets you upload your site, and at no cost if you are under the free tier.</p><p>Next post I will show you how to register and link your own domain to it.</p><p>Let's begin with logging in and heading to the dashboard. Click and open up S3.</p><a href='/images/p8.jpg' target='_blank' class='center'><img src='/images/p8.jpg' class='img-thumbnail img-article' alt='S3'></a><p class='justify'>I will follow this one with you for the sake of actually doing it and to take screenshots as I go along. I am going to be using my nickname in college as the site name which will be Antwan TwerkSwag. Yes, they did call me that. Twan for short. The site, when finished, will be antwantwerkswag.com.</p><p class='justify'>Okay, we will be creating two buckets. Both buckets will be used later when we route to them. One will be yourdomainname.com and the other will be www.yourdomainname.com. Choose whatever you can think of that is not already used. Sadly, your first and last name probably is already taken unless it’s an alter ego like Antwan TwerkSwag. </p><p>You can check if you can use the domain name by going to the AWS console in a new tab. Click Route 53.</p><a href='/images/p9.jpg' target='_blank' class='center'><img src='/images/p9.jpg' class='img-thumbnail img-article' alt='Route 53'></a><p>Enter a domain name in the register domain checking area and click check.</p><p>If you see a green check, then good. It is good to use. Next post will be registering it and assigning it to your S3 bucket.</p><p class='justify'>Go back to your tab with S3. Click create bucket, add your domain name that you chose and put .com at the end of it. Choose a region where you are generally located. I chose US Standard just because. Okay click create and repeat the process with www. at the beginning of it as well.</p><a href='/images/p14.jpg' target='_blank' class='center'><img src='/images/p14.jpg' class='img-thumbnail img-article' alt='Create bucket'></a><p class='justify'>Click on the domain that has the www. This is where we will put your website into. I hope you do have a website to put in here. Click actions to upload some files.</p><a href='/images/p15.jpg' target='_blank' class='center'><img src='/images/p15.jpg' class='img-thumbnail img-article' alt='Upload to bucket'></a><p>Drag your files. I hope your site has more files than mine. Click start upload.</p><a href='/images/p16.jpg' target='_blank' class='center'><img src='/images/p16.jpg' class='img-thumbnail img-article' alt='Drag files to bucket'></a><p class='justify'>Nice, your site is in the cloud. To view it click the properties button. Go into static website hosting. Click enable website hosting. Enter the index document when you click enable website hosting. Mine would be index.html. Click Save.</p><a href='/images/p17.jpg' target='_blank' class='center'><img src='/images/p17.jpg' class='img-thumbnail img-article' alt='Enable website'></a><p class='justify'>Before clicking the endpoint, or the URL, you will have to give access to your s3 bucket. Unfortunately, if you do click it, you will be denied access. To give access to your bucket items, drop the permissions section down and click add bucket policy.</p><a href='/images/p18.jpg' target='_blank' class='center'><img src='/images/p18.jpg' class='img-thumbnail img-article' alt='Add bucket policy'></a><p>In the modal that pops up enter this:</p><a href='/images/p19.jpg' target='_blank' class='center'><img src='/images/p19.jpg' class='img-thumbnail img-article' alt='Policy'></a><div class='center'><p>{<br>&nbsp;&nbsp;&nbsp;&nbsp;'Version': '2012-10-17',<br>&nbsp;&nbsp;&nbsp;&nbsp;'Statement': [<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;{<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;'Sid': 'Allow Public Access to All Objects',<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;'Effect': 'Allow',<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;'Principal': '*',<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;'Action': 's3:GetObject',<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;'Resource': 'arn:aws:s3:::www.antwantwerkswag.com/*'<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;}<br>&nbsp;&nbsp;&nbsp;&nbsp;]<br>}</p></div><p class='justify'>Make sure you place your domain name In lieu of antwanterkswag. Click save. Now You will have access to that link and everyone has access to your site.</p><p>Next will dicover how to add your domain name to it and a couple modifications to your other bucket.</p><p>Stay classy my friends.</p>"
	},
	{
		"name":"2016-05-18",
		"title":"Register Domain With Route 52 and Direct it to S3",
		"date":"2016-05-18",
		"category":"posts",
		"keywords":"Domain,Route 53,Hosted Zones,non-www,www,Redirect,S3,AWS,Alias Target",
		"description":"Register your domain and direct it to your www S3 website. Redirect from non-www to www.",
		"header":"I bet you have been wanting your own website. This will show ya. I hope you can do it. This will show what it takes to get a domain and call it yours. Good luck you guys and girls.",
		"html":"<p class='justify'>It took me to do this a while the first time but after a couple of times doing this it is as easy as 1, 2, 3. Well, it takes about an hour to two hours, maybe less. But you should be in the right area if you want to get your own domain name for your website. Let's start.</p><a href='/images/p7.jpg' target='_blank' class='center'><img src='/images/p7.jpg' class='img-thumbnail img-article' alt='AWS Console'></a><p class='justify'>Let's start with going to the AWS Console. Oh yes, please review my earlier posts if you have not.</p><a href='/images/p9.jpg' target='_blank' class='center'><img src='/images/p9.jpg' class='img-thumbnail img-article' alt='Route 53'></a><p class='justify'>We will begin with clicking Route 53. Go ahead and choose a domain name and check if it is available. Review that you spelled it correctly and press add to cart. NOTICE you will pay monies. Add to cart if it exists.</p><a href='/images/p11.jpg' target='_blank' class='center'><img src='/images/p11.jpg' class='img-thumbnail img-article' alt='Register Domain'></a><p>Review again and scroll down and click continue.</p><a href='/images/p12.jpg' target='_blank' class='center'><img src='/images/p12.jpg' class='img-thumbnail img-article' alt='Continue Purchase'></a><p class='justify'>Put your contact details. I recommend clicking the hide contact information if you do not want to receive random crap. Click Continue. Check I have read and agree to the AWS Domain Name Registration Agreement. Click Complete. Purchase.</p><a href='/images/p13.jpg' target='_blank' class='center'><img src='/images/p13.jpg' class='img-thumbnail img-article' alt='Complete Purchase'></a><p>You will be redirected and will see a link where your domain will be populated when finished. This domain registration process should take a good chunck of your time.</p><a href='/images/p20.jpg' target='_blank' class='center'><img src='/images/p20.jpg' class='img-thumbnail img-article' alt='Domain Registration Status'></a><p class='justify'>Take five and go do something else. You should get an email saying your domain successfully registered in around 15 minutes.</p><a href='/images/p21.jpg' target='_blank' class='center'><img src='/images/p21.jpg' class='img-thumbnail img-article' alt='Email of successful registration'></a><p class='center'>Fuck Yea! A domain has been born.</p><a href='/images/p22.jpg' target='_blank' class='center'><img src='/images/p22.jpg' class='img-thumbnail img-article' alt='Fuck Yea'></a><p class='justify'>Oops, sorry, meant to put that at the bottom. We still need to do some routing. We are half way there. I believe in you! Once you’re ready go back to your AWS console and click Route 53, if you are not already in it. You will notice that it will show that your site has been registered. We will want to go to your new hosted zone. Click on hosted zones.</p><a href='/images/p23.jpg' target='_blank' class='center'><img src='/images/p23.jpg' class='img-thumbnail img-article' alt='Route 53 to Hosted Zones'></a><p>Then click on your newly created hosted zone.</p><a href='/images/p24.jpg' target='_blank' class='center'><img src='/images/p24.jpg' class='img-thumbnail img-article' alt='Hosted Zones to zone'></a><p class='justify'>You will see that the next screen shows two records. One is the Name Server. The other is the Start of Authority. What are these? I do not want to answer since google may have a better answer for you. But we will need to create two records. They will be the www and the non-www links to your website. For example: www.yourcoolwebsite.com and yourcoolwebsite.com. That is what we will be adding.</p><a href='/images/p25.jpg' target='_blank' class='center'><img src='/images/p25.jpg' class='img-thumbnail img-article' alt='Hosted Zone records'></a><p class='justify'>Let's start with the www version of the site. Put www in the name. Check Yes for Alias. Select the S3 website endpoint for the Alias Target. Leave everything else as is and click create.</p><a href='/images/p26.jpg' target='_blank' class='center'><img src='/images/p26.jpg' class='img-thumbnail img-article' alt='Create Record www'></a><p class='justify'>Then we will do the same thing but for the non-www link. Click Create Record Set for a second time. Leave name empty this time. Click Alias Target and scroll down to Record sets and click yours. Click Create.</p><a href='/images/p27.jpg' target='_blank' class='center'><img src='/images/p27.jpg' class='img-thumbnail img-article' alt='Create Record non-www'></a><p class='justify'>You see the www version when you click the Alias Target because in the last post we added permissions to the bucket policy. We only did this for the www version. As of now, you may use the www version of the site. Before you do that lets make the non-www version of the site redirect to the www version of the site.</p><p>Go back to the AWS Console and click S3.</p><a href='/images/p8.jpg' target='_blank' class='center'><img src='/images/p8.jpg' class='img-thumbnail img-article' alt='S3'></a><p class='justify'>Click the non-www version of your site in S3. Click the properties button. Drop down the Static Web Hosting section. Click Redirect all requestes to another host name. Enter the www version of the site. In my case it was smart enought to enter it in. Click Save.</p><a href='/images/p28.jpg' target='_blank' class='center'><img src='/images/p28.jpg' class='img-thumbnail img-article' alt='Redirect non-www site'></a><p class='justify'>And there you have it. Both versions work and you have very own website.</p><p>Stay brilliant my friends.</p>"
	},
	{
		"name":"2016-05-23",
		"title":"START SERVER INSTANCE WITH EC2",
		"date":"2016-05-23",
		"category":"posts",
		"keywords":"EC2,AWS,Server,Instance,Free Tier",
		"description":"Start your server instance with EC2 on Amazon.",
		"header":"This is the first part if you want to create your own backend or really anything that needs processing. Later on we will be looking at Cloudfront that will help us with the instance.",
		"html":"<p class='justify'>Hopefully you still have the ability to use the free tier stuff that amazon gives so this may be cheaper for you. The purpose of this post is to set things up for future posts.</p><p class='justify'>Here I am not going to go through all the steps to set it up but give resources to you. There is a bunch out there. If you do not know why you need to do this, you may look further to what you need to do for your needs.</p><h4>But I must require you to do somethings</h4><ul><li><b>Windows,</b> has to be a Windows. You might be able to get by with linux, but I do not know if I will be able to help you with linux related steps.<a href='/images/p29.jpg' target='_blank' class='center'><img src='/images/p29.jpg' class='img-thumbnail img-article' alt='Free tier eligible'></a></li><li><b>Instance Location has to be in US East (N. Virginia).</b>This is because you can only use the AWS Certificate Manager there. <a href='http://docs.aws.amazon.com/acm/latest/userguide/acm-regions.html' target='_blank'><em>*It looks like you can now.</em></a></li><li><b>Follow a good tutorial.</b> Here are some below.</li></ul><p><a href='http://docs.aws.amazon.com/AWSEC2/latest/UserGuide/EC2_GetStarted.html' target='_blank'>Getting Started with Amazon EC2 Linux Instances - Amazon Elastic Compute Cloud</a><br><a href='http://techshangrila.blogspot.com/2016/01/how-to-create-free-windows-ec2-instance.html' target='_blank'>My Technical Blog: How to Create a Free Windows EC2 Instance on Amazon EC2</a><br><a href='http://docs.aws.amazon.com/AWSEC2/latest/WindowsGuide/connecting_to_windows_instance.html#connect-rdp' target='_blank'>Connecting to Your Windows Instance Using RDP - Amazon Elastic Compute Cloud</a></p><p class='justify'>These links should basically set things up. If you find one that really helps, let me see it. I'll put it with the links.</p>"
	}
]